[
  {
    "year": 2025,
    "month": "Май",
    "title": "Создание системы обучения бота",
    "content": "Разработка системы обучения для бота позволит нам оперативно и без значительных трудозатрат подготовить бота к работе без необходимости вносить изменения в его программный код.",
    "status": "готово"
  },
  {
    "year": 2025,
    "month": "Май",
    "title": "Создание системы баннеров",
    "content": "Разработанная система баннеров предоставляет возможность оперативного и простого создания баннеров. Кроме того, были созданы шаблоны баннеров для быстрого внедрения на страницу.",
    "status": "готово"
  },
  {
    "year": 2025,
    "month": "Май",
    "title": "Лента прогресса M5wiki",
    "content": "Лента прогресса, чтобы пользователи видели прогресс создания и развития m5wiki.",
    "status": "готово"
  },
  {
    "year": 2025,
    "month": "Май",
    "title": "Обновления структуры m5wiki",
    "content": "Обновление структуры m5wiki поможет нам сделать намного больше отвлечения, чем было раньше.",
    "status": "готово"
  },
  {
    "year": 2025,
    "month": "Июнь",
    "title": "Обучение бота M5wiki",
    "content": "Обучить бота m5wiki к поискам гайда, перенаправка на посты, минимальный разговор.",
    "status": "планируется"
  },
  {
    "year": 2025,
    "month": "Май",
    "title": "Улучшенный нижний колонтитул",
    "content": "Разработать усовершенствованный код для нижнего колонтитула, который позволит сделать его более привлекательным по сравнению с текущей версией и обеспечить большую гибкость при внесении изменений.",
    "status": "готово"
  },
  {
    "year": 2025,
    "month": "Июнь",
    "title": "Разработка системы для создания страниц",
    "content": "Разработка системы для создания страниц на m5wiki позволит создавать красивые и функциональные страницы в кратчайшие сроки.",
    "status": "готово"
  },
  {
    "year": 2025,
    "month": "Июнь",
    "title": "Адаптировать все страницы под новый код",
    "content": "Адаптировать все страницы к новому коду. Это позволит сделать их более привлекательными и гибкими за счёт использования нового кода.",
    "status": "в процессе"
  },
  {
    "year": 2025,
    "month": "Июнь",
    "title": "Адаптация кода для телефона на странице «План по разработке M5wiki»",
    "content": "Адаптация кода для мобильных устройств на странице «План по разработке M5wiki» сделает её более читабельной и удобной для пользователей.",
    "status": "готово"
  },
  {
    "year": 2025,
    "month": "Июнь",
    "title": "Автоматическое открытие года и месяца на странице «План и разработка M5wiki»",
    "content": "Автоматическое определение года и месяца на странице «План и разработка M5wiki». Это значит, что при переходе на страницу не нужно будет вручную прокручивать её до нужной даты, а код сам определит год и месяц и откроет соответствующую дату.",
    "status": "готово"
  }
]
